app/views/pins/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = ?  [["pin_id", 12]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."pin_id" = ?  [["pin_id", 12]]
---
     <div class="col-md-offset-2 col-md-8">
            <h2><strong><%= @pin.comments.count %></strong> Comments</h2>