app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "created_at", "updated_at", "pin_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "one"], ["created_at", "2018-05-07 23:47:10.452680"], ["updated_at", "2018-05-07 23:47:10.452680"], ["pin_id", 11], ["user_id", 2]]
---
    def create
        @comment = current_user.comments.create!(params.require(:comment).permit(:comment, :pin_id))

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."pin_id" = ? AND "comments"."id" = ? LIMIT ?  [["pin_id", 11], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
        @pin = Pin.find(params[:pin_id])
        @comment = @pin.comments.find(params[:id])
        @comment.destroy