app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 50)
---
SELECT  "pins".* FROM "pins" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 50], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["description", "This is my first pin"], ["created_at", "2018-05-04 17:41:13.246243"], ["updated_at", "2018-05-04 17:41:13.246243"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "This is my first pin 2"], ["updated_at", "2018-05-04 17:41:22.707904"], ["id", 5]]

  def destroy
    @pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 3]]

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]